{
  "BusinessApplications": [
    {
      "id": "/aws/service/AppFabric",
      "fullName": "AWS AppFabric",
      "shortName": "AppFabric",
      "iconPath": "AWS-Icons_07312025/Business-Applications/AWS-AppFabric/Service_AWS-AppFabric.svg",
      "description": "AWS AppFabric is a fully managed service that aggregates and normalizes security data across software as a service (SaaS) applications. Previously, integrating SaaS applications with existing security tools required teams to build, manage, and maintain their own point-to-point (P2P) integrations so that security teams could monitor event logs and understand activity from each application. With AppFabric, you can quickly connect multiple SaaS applications to increase observability, productivity, and security-with no coding required.\nAfter the SaaS applications are authorized and connected, AppFabric ingests the data and normalizes it using the Open Cybersecurity Schema Framework (OCSF). OCSF allows you to set common policies, standardize security alerts, and quickly manage user access across multiple applications.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/Chime",
      "fullName": "Amazon Chime",
      "shortName": "Chime",
      "iconPath": "AWS-Icons_07312025/Business-Applications/Amazon-Chime/Service_Amazon-Chime.svg",
      "description": "Amazon Chime is a communications service that transforms online meetings with a secure, easy-to-use application that you can trust. Amazon Chime works seamlessly across your devices so that you can stay connected. You can use Amazon Chime for online meetings, video conferencing, calls, chat, and to share content, both inside and outside your organization.\nAmazon Chime works with Alexa for Business, which means you can use Alexa to start your meetings with your voice. Alexa can start your video meetings in large conference rooms, and automatically dial into online meetings in smaller huddle rooms and from your desk.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/ChimeSDK",
      "fullName": "Amazon Chime SDK",
      "shortName": "Chime SDK",
      "iconPath": "AWS-Icons_07312025/Business-Applications/Amazon-Chime-SDK/Service_Amazon-Chime-SDK.svg",
      "description": "With the Amazon Chime SDK, builders can easily add real-time voice, video, and messaging powered by ML into their applications.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/Connect",
      "fullName": "Amazon Connect",
      "shortName": "Connect",
      "iconPath": "AWS-Icons_07312025/Business-Applications/Amazon-Connect/Service_Amazon-Connect.svg",
      "description": "Amazon Connect is a self-service, omnichannel cloud contact center service that makes it easy for any business to deliver better customer service at lower cost. Amazon Connect is based on the same contact center technology used by Amazon customer service associates around the world to power millions of customer conversations. The self-service graphical interface in Amazon Connect makes it easy for non-technical users to design contact flows, manage agents, and track performance metrics - no specialized skills required. There are no up-front payments or long-term commitments and no infrastructure to manage with Amazon Connect; customers pay by the minute for Amazon Connect usage plus any associated telephony services.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/EndUserMessaging",
      "fullName": "AWS End User Messaging",
      "shortName": "End User Messaging",
      "iconPath": "AWS-Icons_07312025/Business-Applications/AWS-End-User-Messaging/Service_AWS-End-User-Messaging.svg",
      "description": "AWS End User Messaging is a service that enables you to send messages to end users across multiple channels including SMS, push notifications, and email. The service provides a unified API to send messages through different channels, making it easier to reach customers on their preferred communication platforms. With End User Messaging, you can send transactional messages such as order confirmations, authentication codes, and account notifications, as well as promotional campaigns. The service handles the complexity of managing multiple messaging providers, optimizing delivery routes, and ensuring compliance with regulations across different regions and channels.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/Pinpoint",
      "fullName": "Amazon Pinpoint",
      "shortName": "Pinpoint",
      "iconPath": "AWS-Icons_07312025/Business-Applications/Amazon-Pinpoint/Service_Amazon-Pinpoint.svg",
      "description": "Amazon Pinpoint makes it easy to send targeted messages to your customers through multiple engagement channels. Examples of targeted campaigns are promotional alerts and customer retention campaigns, and transactional messages are messages such as order confirmations and password reset messages.\nYou can integrate Amazon Pinpoint into your mobile and web apps to capture usage data to provide you with insight into how customers interact with your apps. Amazon Pinpoint also tracks the ways that your customers respond to the messages you send-for example, by showing you the number of messages that were delivered, opened, or clicked.\nYou can develop custom audience segments and send them pre-scheduled targeted campaigns via email, SMS, and push notifications. Targeted campaigns are useful for sending promotional or educational content to re-engage and retain your users.\nYou can send transactional messages using the console or the Amazon Pinpoint REST API. Transactional campaigns can be sent via email, SMS, push notifications, and voice messages. You can also use the API to build custom applications that deliver campaign and transactional messages.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/SES",
      "fullName": "Amazon SES",
      "shortName": "SES (Simple Email Service)",
      "iconPath": "AWS-Icons_07312025/Business-Applications/Amazon-Simple-Email-Service/Service_Amazon-Simple-Email-Service.svg",
      "description": "Amazon Simple Email Service (Amazon SES) is a cost-effective, flexible, and scalable email service that enables developers to send mail from within any application. You can configure Amazon SES quickly to support several email use cases, including transactional, marketing, or mass email communications. The Amazon SES flexible IP deployment and email authentication options help drive higher deliverability and protect sender reputation, while sending analytics measure the impact of each email. With Amazon SES, you can send email securely, globally, and at scale.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/SupplyChain",
      "fullName": "AWS Supply Chain",
      "shortName": "Supply Chain",
      "iconPath": "AWS-Icons_07312025/Business-Applications/AWS-Supply-Chain/Service_AWS-Supply-Chain.svg",
      "description": "AWS Supply Chain is a cloud-based application that unifies data from existing supply chain systems to provide improved visibility and insights. The service uses machine learning to generate actionable recommendations that help mitigate risks and lower costs. AWS Supply Chain automatically combines and analyzes supply chain data from disparate systems to provide a unified view of your supply chain, offering real-time visibility into inventory levels, demand forecasts, and potential disruptions. With built-in collaboration tools, AWS Supply Chain enables different stakeholders across your organization to work together more effectively to address supply chain challenges and optimize operations.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/Wickr",
      "fullName": "AWS Wickr",
      "shortName": "Wickr",
      "iconPath": "AWS-Icons_07312025/Business-Applications/AWS-Wickr/Service_AWS-Wickr.svg",
      "description": "AWS Wickr is an end-to-end encrypted communication service that provides secure messaging, voice and video calling, file sharing, and screen sharing for businesses and organizations. Built with a zero-trust security model, Wickr ensures that only intended recipients can access communications, with no access by AWS or any third parties. The service offers features including message expiration, screenshot detection, and detailed administrative controls. AWS Wickr is designed for organizations that require the highest levels of security and privacy for their communications, including those in government, healthcare, financial services, and other regulated industries where protecting sensitive information is critical.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/WorkDocs",
      "fullName": "Amazon WorkDocs",
      "shortName": "WorkDocs",
      "iconPath": "AWS-Icons_07312025/Business-Applications/Amazon-WorkDocs/Service_Amazon-WorkDocs.svg",
      "description": "New customer sign-ups and account upgrades are no longer available for Amazon WorkDocs.\nAmazon WorkDocs is a fully managed, secure enterprise storage and sharing service with strong administrative controls and feedback capabilities that improve user productivity. Users can comment on files, send them to others for feedback, and upload new versions without having to resort to emailing multiple versions of their files as attachments. Users can take advantage of these capabilities wherever they are, using the device of their choice, including PCs, Macs, tablets, and phones. Amazon WorkDocs offers IT administrators the option of integrating with existing corporate directories, flexible sharing policies and control of the location where data is stored.",
      "categoryId": "/aws/category/Business"
    },
    {
      "id": "/aws/service/WorkMail",
      "fullName": "Amazon WorkMail",
      "shortName": "WorkMail",
      "iconPath": "AWS-Icons_07312025/Business-Applications/Amazon-WorkMail/Service_Amazon-WorkMail.svg",
      "description": "Amazon WorkMail is a secure, managed business email and calendar service with support for existing desktop and mobile email client applications. Amazon WorkMail gives users the ability to seamlessly access their email, contacts, and calendars using the client application of their choice, including Microsoft Outlook, native iOS and Android email applications, any client application supporting the IMAP protocol, or directly through a web browser. You can integrate Amazon WorkMail with your existing corporate directory, use email journaling to meet compliance requirements, and control both the keys that encrypt your data and the location in which your data is stored. You can also set up interoperability with Microsoft Exchange Server, and programmatically manage users, groups, and resources using the Amazon WorkMail SDK.",
      "categoryId": "/aws/category/Business"
    }
  ]
}
