{
  "Media": [
    {
      "id": "/aws/service/ElasticTranscoder",
      "fullName": "Amazon Elastic Transcoder",
      "shortName": "Elastic Transcoder",
      "iconPath": "AWS-Icons_07312025/Media-Services/Amazon-Elastic-Transcoder/Service_Amazon-Elastic-Transcoder.svg",
      "description": "Amazon Elastic Transcoder is media transcoding in the cloud. It is designed to be a highly scalable, easy-to-use, and cost-effective way for developers and businesses to convert (or transcode) media files from their source format into versions that will play back on devices such as smartphones, tablets, and PCs.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/IVS",
      "fullName": "Amazon Interactive Video Service",
      "shortName": "IVS (Interactive Video Service)",
      "iconPath": "AWS-Icons_07312025/Media-Services/Amazon-Interactive-Video-Service/Service_Amazon-Interactive-Video-Service.svg",
      "description": "Amazon Interactive Video Service (Amazon IVS) is a managed live streaming solution that is quick and easy to set up, and ideal for creating interactive video experiences. Send your live streams to Amazon IVS using streaming software and the service does everything you need to make low-latency live video available to any viewer around the world, letting you focus on building interactive experiences alongside the live video. You can easily customize and enhance the audience experience through the Amazon IVS player SDK and timed metadata APIs, allowing you to build a more valuable relationship with your viewers on your own websites and applications.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/NimbleStudio",
      "fullName": "Amazon Nimble Studio",
      "shortName": "Nimble Studio",
      "description": "Amazon Nimble Studio empowers creative studios to produce visual effects, animation, and interactive content entirely in the cloud, from storyboard sketch to final deliverable. Rapidly onboard and collaborate with artists globally and create content faster with access to virtual workstations, high-speed storage, and scalable rendering across the AWS global infrastructure.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/ElementalAppliancesAndSoftware",
      "fullName": "AWS Elemental Appliances and Software",
      "shortName": "Elemental Appliances and Software",
      "iconPath": "AWS-Icons_07312025/Media-Services/AWS-Elemental-Appliances-&-Software/Service_AWS-Elemental-Appliances-&-Software.svg",
      "description": "AWS Elemental Appliances and Software solutions bring advanced video processing and delivery technologies into your data center, co-location space, or on-premises facility. You can deploy AWS Elemental Appliances and Software to encode, package, and deliver video assets on-premises and seamlessly connect with cloud-based video infrastructure. Designed for easy integration with AWS Cloud media solutions, AWS Elemental Appliances and Software support video workloads that need to remain on-premises to accommodate physical camera and router interfaces, managed network delivery, or network bandwidth constraints. AWS Elemental Live, AWS Elemental Server, and AWS Elemental Conductor come in two variants: ready-to-deploy appliances, or AWS-licensed software that you install on your own hardware. AWS Elemental Link is a compact hardware device that sends live video to the cloud for encoding and delivery to viewers.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/ElementalMediaConnect",
      "fullName": "AWS Elemental MediaConnect",
      "shortName": "Elemental MediaConnect",
      "iconPath": "AWS-Icons_07312025/Media-Services/AWS-Elemental-MediaConnect/Service_AWS-Elemental-MediaConnect.svg",
      "description": "AWS Elemental MediaConnect is a high-quality transport service for live video. Today, broadcasters and content owners rely on satellite networks or fiber connections to send their high-value content into the cloud or to transmit it to partners for distribution. Both satellite and fiber approaches are expensive, require long lead times to set up, and lack the flexibility to adapt to changing requirements. To be more nimble, some customers have tried to use solutions that transmit live video on top of IP infrastructure, but have struggled with reliability and security.\nNow you can get the reliability and security of satellite and fiber combined with the flexibility, agility, and economics of IP-based networks using AWS Elemental MediaConnect. MediaConnect enables you to build mission-critical live video workflows in a fraction of the time and cost of satellite or fiber services. You can use MediaConnect to ingest live video from a remote event site (such as a stadium), share video with a partner (such as a cable TV distributor), or replicate a video stream for processing (such as an over-the-top service). MediaConnect combines reliable video transport, highly secure stream sharing, and real-time network traffic and video monitoring that allow you to focus on your content, not your transport infrastructure.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/ElementalMediaConvert",
      "fullName": "AWS Elemental MediaConvert",
      "shortName": "Elemental MediaConvert",
      "iconPath": "AWS-Icons_07312025/Media-Services/AWS-Elemental-MediaConvert/Service_AWS-Elemental-MediaConvert.svg",
      "description": "AWS Elemental MediaConvert is a file-based video transcoding service with broadcast-grade features. It allows you to easily create video-on-demand (VOD) content for broadcast and multiscreen delivery at scale. The service combines advanced video and audio capabilities with a simple web services interface and pay-as-you-go pricing. With AWS Elemental MediaConvert, you can focus on delivering compelling media experiences without having to worry about the complexity of building and operating your own video processing infrastructure.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/ElementalMediaLive",
      "fullName": "AWS Elemental MediaLive",
      "shortName": "Elemental MediaLive",
      "iconPath": "AWS-Icons_07312025/Media-Services/AWS-Elemental-MediaLive/Service_AWS-Elemental-MediaLive.svg",
      "description": "AWS Elemental MediaLive is a broadcast-grade live video processing service. It lets you create high-quality video streams for delivery to broadcast televisions and internet-connected multiscreen devices, such as connected TVs, tablets, smart phones, and set-top boxes. The service works by encoding your live video streams in real-time, taking a larger-sized live video source and compressing it into smaller versions for distribution to your viewers. With AWS Elemental MediaLive, you can easily set up streams for both live events and 24x7 channels with advanced broadcasting features, high availability, and pay-as-you-go pricing. AWS Elemental MediaLive lets you focus on creating compelling live video experiences for your viewers without the complexity of building and operating broadcast-grade video processing infrastructure.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/ElementalMediaPackage",
      "fullName": "AWS Elemental MediaPackage",
      "shortName": "Elemental MediaPackage",
      "iconPath": "AWS-Icons_07312025/Media-Services/AWS-Elemental-MediaPackage/Service_AWS-Elemental-MediaPackage.svg",
      "description": "AWS Elemental MediaPackage reliably prepares and protects your video for delivery over the Internet. From a single video input, AWS Elemental MediaPackage creates video streams formatted to play on connected TVs, mobile phones, computers, tablets, and game consoles. It makes it easy to implement popular video features for viewers (start-over, pause, rewind, and so on), such as those commonly found on DVRs. AWS Elemental MediaPackage can also protect your content using Digital Rights Management (DRM). AWS Elemental MediaPackage scales automatically in response to load, so your viewers will always get a great experience without you having to accurately predict in advance the capacity you’ll need.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/ElementalMediaStore",
      "fullName": "AWS Elemental MediaStore",
      "shortName": "Elemental MediaStore",
      "iconPath": "AWS-Icons_07312025/Media-Services/AWS-Elemental-MediaStore/Service_AWS-Elemental-MediaStore.svg",
      "description": "AWS Elemental MediaStore is an AWS storage service optimized for media. It gives you the performance, consistency, and low latency required to deliver live streaming video content. AWS Elemental MediaStore acts as the origin store in your video workflow. Its high performance capabilities meet the needs of the most demanding media delivery workloads, combined with long-term, cost-effective storage.",
      "categoryId": "/aws/category/Media"
    },
    {
      "id": "/aws/service/ElementalMediaTailor",
      "fullName": "AWS Elemental MediaTailor",
      "shortName": "Elemental MediaTailor",
      "iconPath": "AWS-Icons_07312025/Media-Services/AWS-Elemental-MediaTailor/Service_AWS-Elemental-MediaTailor.svg",
      "description": "AWS Elemental MediaTailor lets video providers insert individually targeted advertising into their video streams without sacrificing broadcast-level quality-of-service. With AWS Elemental MediaTailor, viewers of your live or on-demand video each receive a stream that combines your content with ads personalized to them. But unlike other personalized ad solutions, with AWS Elemental MediaTailor your entire stream – video and ads – is delivered with broadcast-grade video quality to improve the experience for your viewers. AWS Elemental MediaTailor delivers automated reporting based on both client and server-side ad delivery metrics, making it easy to accurately measure ad impressions and viewer behavior. You can easily monetize unexpected high-demand viewing events with no up-front costs using AWS Elemental MediaTailor. It also improves ad delivery rates, helping you make more money from every video, and it works with a wider variety of content delivery networks, ad decision servers, and client devices.",
      "categoryId": "/aws/category/Media"
    }
  ]
}
